app/controllers/shop_controller.rb

  def items
    @titles = Title.all
---
SELECT "titles".* FROM "titles"